{"pageProps":{"blogPost":{"id":"building-serverless-rest-apis-in-aws-using-typescript-koajs-serverless-framework","title":"Building Serverless REST APIs in AWS using Typescript KoaJS and the Serverless Framework","date":"2022-09-18","summary":"This post is about the serverless architecture and how I used it to build serverless APIs with KoaJs and the Serverless Framework using AWS. It also introduces a Serverless Framework Typescript template that can be used to easily spin up a new KoaJS application running on AWS using AWS Lambda and exposed via the Amazon API Gateway.","tags":["serverless","koajs","serverless framework","AWS","FaaS"],"content":"<p>While at <a href=\"https://joincolab.io\">Co.Lab</a>, we wanted to train people looking propel their tech careers and in order to scale out our training we decided to build tools to reduce the amount of human effort required to facilitate our programs. Part of the tools we built was a collaborative learning platform where students could watch their pre-recorded lessons together (think Netflix watch parties but for education) complemented by collaborative documents for students to participate in lesson activities together. I like to use the term \"synchronized lesson content delivery\" to describe it.</p>\n<p>Our technology stack for building our tools is:</p>\n<ul>\n<li>Typescript as the programming language across backend and frontend</li>\n<li>KoaJS as our web application framework</li>\n<li>ReactJS for frontend development</li>\n<li>DynamoDB for the database</li>\n<li>AWS serverless architecture using AWS API Gateway &#x26; AWS Lambda</li>\n<li>Serverless for configuration management</li>\n</ul>\n<p>In this post, I'd like to briefly introduce you to the Serverless Architecture and how we built a serverless APIs with KoaJS and the Serverless Framework using AWS as our Cloud Service Provider.</p>\n<h2>Serverless Architecture</h2>\n<p>The Serverless architecture is a method of software application design that enables you build and run your applications without having to worry about managing software infrastructure. It takes away concerns such as what machines (physical or virtual) that the application will run on, how many they are and all the details involved with scaling it.</p>\n<p>Cloud Service Providers usually provide services that enable developers build serverless applications. For example, Amazon Web Services (AWS) has <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> which is used in conjuction with <a href=\"https://aws.amazon.com/api-gateway/\">Amazon API Gateway</a> to provide serverless based web APIs. Google Cloud Platform (GCP) has <a href=\"https://cloud.google.com/functions\">Cloud Functions</a>, <a href=\"https://cloud.google.com/run\">Cloud Run</a> and <a href=\"https://cloud.google.com/appengine\">App Engine</a> to enable developers build different types serverless computing workloads. Also, Microsoft Azure has <a href=\"https://azure.microsoft.com/en-ca/services/functions/\">Azure Functions</a> as their serverless offering too. Serverless products offered by Cloud Service Providers are usually categorized as Function as a Service (Faas).S</p>\n<p>Given that we're a young startup, it's important to be cost-effective with our design decisions. It's important to us that we don't consume more resources than we need but still be able to adapt and evolve to growing demand our services. Cloud Service Providers usually have a request-based cost model such that you're charged by the number of requests your services handle, taking into account the amount of time that your services use compute resources to handle the requests. serverless platforms do their best to spin up and down the compute resources you use so as to not add extra latency for your requests and so that you don't get charged when your service isn't doing anything.</p>\n<p>Another great benefit with serverless architectures is the ability to detect increase in traffic and smoothly scale up resources to handle the increase. Say you have an ecommerce site for your small business and then you run a small promo on instagram for a Black Friday sale which gathers a lot of attention. If tons of people flock to your site, most serverless platforms can detect this and scale up to handle the increased traffic.</p>\n<p>I've found though that as your service's load increases, there comes a point where it's just more cost effective to have a dedicated set of compute resources (servers, or nodes or pods depending on your underlying deployment model) running or in stand by to handle your requests. However, serverless is really great for bootstrapping applications and providing value quickly in a cost effective manner.</p>\n<p>At the heart of the serverless architecture are serverless functions which is are pieces of ephemeral and stateless business logic software hosted on some managed infrastructure. The infrastructure providers take care of providing an interface to invoke these functions. They also take care of scalability concerns as the number of invocations of your function increases. Imagine you've built a whole javascript application with tons of important functions doing important business logic. Serverless architecture essentially enables you to deploy each of those functions as individual lightweight applications.</p>\n<h2>KoaJS</h2>\n<p><a href=\"https://koajs.com/\">KoaJS</a> is a node.js web framework built by the creators of express.js - the OG node.js web framework. It's really great for building web applications and APIs. It leverages the (async/await) functions rather than callbacks which encourages easier-to-follow code.</p>\n<h2>Serverless Framework</h2>\n<p>The <a href=\"https://serverless.com/framework\">Serverless framework</a> provides an easy and open way to build serverless applications. It allows you to define your serverless infrastructure and all it's resources using a cloud service provider agnostic representation. The serverless framework makes it super easy to do CI/CD because once you've defined your applications serverless resources using the framework, deployments and updates are as easy as one CLI command.</p>\n<p>For users of KoaJS with TypeScript, in this blog post, I'll introduce you to a serverless template to help you get up and running with a TypeScript KoaJS application for deployment <a href=\"https://aws.amazon.com/lambda/\">AWS Lambda</a> and exposed via <a href=\"https://aws.amazon.com/api-gateway/\">AWS API Gateway</a>.</p>\n<p>When using the serverless framework with AWS, it leverages common AWS services to make your application accessible over the internet.</p>\n<p>You can find the full template <a href=\"https://github.com/jleoirab/serverless-aws-koajs-typescript-template\">here</a>. It leverages the serverless Typescript API to declare your serverless resources.</p>\n<p>At the top level is the <code>serverless.ts</code> file which is the entry point for the serverless framework configuration.</p>\n<pre><code class=\"hljs language-ts\"><span class=\"hljs-keyword\">import</span> <span class=\"hljs-keyword\">type</span> { <span class=\"hljs-variable constant_\">AWS</span> } <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'@serverless/typescript'</span>;\n\n<span class=\"hljs-keyword\">import</span> api <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'@functions/api'</span>;\n\n<span class=\"hljs-keyword\">const</span> <span class=\"hljs-attr\">serverlessConfiguration</span>: <span class=\"hljs-variable constant_\">AWS</span> = {\n  <span class=\"hljs-attr\">service</span>: <span class=\"hljs-string\">'aws-koajs-typescript-template'</span>,\n  <span class=\"hljs-attr\">frameworkVersion</span>: <span class=\"hljs-string\">'2'</span>,\n  <span class=\"hljs-attr\">custom</span>: {\n    <span class=\"hljs-attr\">webpack</span>: {\n      <span class=\"hljs-attr\">webpackConfig</span>: <span class=\"hljs-string\">'./webpack.config.js'</span>,\n      <span class=\"hljs-attr\">includeModules</span>: <span class=\"hljs-literal\">true</span>,\n    },\n  },\n  <span class=\"hljs-attr\">plugins</span>: [\n    <span class=\"hljs-string\">'serverless-webpack'</span>,\n    <span class=\"hljs-string\">'serverless-dotenv-plugin'</span>,\n  ],\n  <span class=\"hljs-attr\">provider</span>: {\n    <span class=\"hljs-attr\">name</span>: <span class=\"hljs-string\">'aws'</span>,\n    <span class=\"hljs-attr\">runtime</span>: <span class=\"hljs-string\">'nodejs16.x'</span>,\n    <span class=\"hljs-attr\">apiGateway</span>: {\n      <span class=\"hljs-attr\">minimumCompressionSize</span>: <span class=\"hljs-number\">1024</span>,\n      <span class=\"hljs-attr\">shouldStartNameWithService</span>: <span class=\"hljs-literal\">true</span>,\n    },\n    <span class=\"hljs-attr\">environment</span>: {\n      <span class=\"hljs-attr\">AWS_NODEJS_CONNECTION_REUSE_ENABLED</span>: <span class=\"hljs-string\">'1'</span>,\n    },\n    <span class=\"hljs-attr\">lambdaHashingVersion</span>: <span class=\"hljs-string\">'20201221'</span>,\n  },\n  <span class=\"hljs-comment\">// import the function via paths</span>\n  <span class=\"hljs-attr\">functions</span>: { api },\n};\n\n<span class=\"hljs-variable language_\">module</span>.<span class=\"hljs-property\">exports</span> = serverlessConfiguration;\n</code></pre>\n<p>The <code>functions</code> property outlines a set of serverless functions. In this approach we'll be deploying a while KoaJS Typescript application as a serverless function. So, the layout of our architecture will look like this:</p>\n<p><img src=\"/images/serverless-with-aws-and-serverlessjs.png\" alt=\"image\"></p>\n<p>The <code>api</code> function configuration looks like this:</p>\n<pre><code class=\"hljs language-ts\"><span class=\"hljs-keyword\">import</span> { handlerPath } <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'@libs/handlerResolver'</span>;\n\n<span class=\"hljs-keyword\">export</span> <span class=\"hljs-keyword\">default</span> {\n  <span class=\"hljs-attr\">handler</span>: <span class=\"hljs-string\">`<span class=\"hljs-subst\">${handlerPath(__dirname)}</span>/handler.main`</span>,\n  <span class=\"hljs-attr\">events</span>: [\n    {\n      <span class=\"hljs-attr\">http</span>: {\n        <span class=\"hljs-attr\">method</span>: <span class=\"hljs-string\">'ANY'</span>,\n        <span class=\"hljs-comment\">// this matches the base path</span>\n        <span class=\"hljs-attr\">path</span>: <span class=\"hljs-string\">'/'</span>,\n      },\n    },\n    {\n      <span class=\"hljs-attr\">http</span>: {\n        <span class=\"hljs-attr\">method</span>: <span class=\"hljs-string\">'ANY'</span>,\n        <span class=\"hljs-comment\">// this matches any path, the token 'any' doesn't mean anything special</span>\n        <span class=\"hljs-attr\">path</span>: <span class=\"hljs-string\">'/{any+}'</span>,\n      },\n    },\n  ],\n}\n</code></pre>\n<p>This leverages the Typescript serverless API to define a function to handle all HTTP events. In AWS terms, this creates an AWS API Gateway endpoint that listenes to all HTTP events. These events are then passed to an AWS Lambda which will house your KoaJS application. This application will then handle the HTTP event accordingly.</p>\n<p>The Serverless framework provides an API to convert AWS http events into requests that your KoaJS application can understand and handle. This API documentation can be found <a href=\"https://www.serverless.com/plugins/serverless-http\">here</a>. You can wrap your KoaJS server in a Serverless HTTP handler like so:</p>\n<pre><code class=\"hljs language-ts\"><span class=\"hljs-keyword\">import</span> <span class=\"hljs-title class_\">ServerlessHttp</span> <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'serverless-http'</span>;\n<span class=\"hljs-keyword\">import</span> <span class=\"hljs-title class_\">Koa</span> <span class=\"hljs-keyword\">from</span> <span class=\"hljs-string\">'koa'</span>;\n\n<span class=\"hljs-keyword\">const</span> app = <span class=\"hljs-keyword\">new</span> <span class=\"hljs-title class_\">Koa</span>();\n\n<span class=\"hljs-comment\">// installation of your routes</span>\n\n\n<span class=\"hljs-keyword\">export</span> <span class=\"hljs-keyword\">const</span> <span class=\"hljs-attr\">main</span>: <span class=\"hljs-title class_\">ServerlessHttp</span>.<span class=\"hljs-property\">Handler</span> = <span class=\"hljs-title class_\">ServerlessHttp</span>(app, {});\n</code></pre>\n<p>Feel free to take a deeper look at the template <a href=\"https://github.com/jleoirab/serverless-aws-koajs-typescript-template\">here</a>. You can also make use of it in your next project.</p>\n<p>First off, you'll need to install serverless. You can check out the serverless installation instructions <a href=\"https://www.serverless.com/framework/docs/getting-started\">here</a>.</p>\n<p>With that, you just need to run:</p>\n<pre><code class=\"hljs language-bash\">serverless create \\\n  --template-url https://github.com/jleoirab/serverless-aws-koajs-typescript-template\n  --path my-service\n</code></pre>\n<p>And then, ensure to install all the npm dependencies:</p>\n<pre><code class=\"hljs language-bash\"><span class=\"hljs-built_in\">cd</span> my-service &#x26;&#x26; npm i\n</code></pre>\n<p>That's it!</p>"}},"__N_SSG":true}